const projects = [
    {
        id: 0,
        title: "Автоматизация заявок на грузоперевозки",
        description: "Телеграм-приложение для удобного оформления заявок на грузоперевозки, с гибкими настройками как для пользователей, так и для администраторов",
        icon: "🚚",
        images: [
            "assets/images/bot0.png",
            "assets/images/bot0/img_0.png",
            "assets/images/bot0/img_1.png",
            "assets/images/bot0/img_2.png",
            "assets/images/bot0/img_3.png",
            "assets/images/bot0/img_4.png",
            "assets/images/bot0/img_5.png",
            "assets/images/bot0/img_6.png",
            "assets/images/bot0/img_7.png",
        ],
        category: "telegram.org",
        status: "Завершен, Поддержка",
        date: "23 сентября 2024 г.",
        tags: ["Python", "Telegram", "PostgreSQL", "Google Sheets"],
        details: {
            fullDescription: "",
            features: [
                "Регистрация компаний, управление ими и назначение сотрудников в уже созданные компании",
                "Оформление заявок на грузоперевозки от имени компании — как её создателем, так и сотрудниками",
                "Запись заявок в Google-таблицу с удобным оформлением и детальной информацией по каждой заявке",
                "Простая и удобная система управления датами загрузок с использованием стандартных функций Telegram",
                "Продвинутая система рассылки сообщений и опросов, позволяющая создавать и управлять группами пользователей, с поддержкой отложенных и ежедневно выполняемых рассылок",
                "Управление списком администрации, блокировка пользователей, добавление новых складов и городов в расписание"
            ],
            tech: "Backend: Aiogram, AsyncPG, GSpread\nDeploy: работает на Linux-сервере, запускается через systemctl",
            stats: [
                { value: "300+", label: "Пользователей" },
                { value: "99.1%", label: "Uptime" }
            ]
        }
    },
    {
        id: 1,
        title: "Телеграм-магазин цифровой книги",
        description: "Автоматизирует оплату и выдачу доступа в закрытый телеграм-канал после подтверждения платежа",
        icon: "📘",
        images: [
            "assets/images/bot1.png",
            "assets/images/bot1/img_0.png",
            "assets/images/bot1/img_1.png",
            "assets/images/bot1/img_2.png",
            "assets/images/bot1/img_3.png",
        ],
        category: "telegram.org",
        status: "Завершен",
        date: "23 ноября 2024 г.",
        tags: ["Python", "Telegram", "SQLite", "ЮKassa"],
        details: {
            fullDescription: "",
            features: [
                "Возможность приобрести подписку для себя или другого пользователя",
                "Множественный выбор суммы доната, включая возможность указать своё числовое значение",
                "Генерация одноразовой ссылки для вступления в телеграм-канал"
            ],
            tech: "Backend: Aiogram, Tortoise-ORM, YooKassa\nDeploy: работает на Linux-сервере, запускается через systemctl",
            stats: [
                { value: "350+", label: "Пользователей" },
                { value: "99.9%", label: "Uptime" }
            ]
        }
    },
    {
        id: 2,
        title: "Автоматизация приёма и просмотра чеков",
        description: "Позволяет загружать и хранить чеки (фото или документы) в боте, с возможностью просмотра их бухгалтером для удобной и быстрой обработки",
        icon: "🧾",
        images: [
            "assets/images/bot2.png",
            "assets/images/bot2/img_0.png",
            "assets/images/bot2/img_1.png",
            "assets/images/bot2/img_2.png",
            "assets/images/bot2/img_3.png",
            "assets/images/bot2/img_4.png",
            "assets/images/bot2/img_5.png",
            "assets/images/bot2/img_6.png",
        ],
        category: "telegram.org",
        status: "Завершен",
        date: "27 сентября 2025 г.",
        tags: ["Python", "Telegram", "SQLite"],
        details: {
            fullDescription: "",
            features: [
                "Управление чеками: загрузка, просмотр и удаление",
                "Разграничение пользователей по ролям: администрация, бухгалтеры и обычные пользователи",
                "Поиск и просмотр чеков с помощью продвинутой и удобной системы фильтров"
            ],
            tech: "Backend: Aiogram, Tortoise-ORM\nDeploy: работает на Linux-сервере, запускается через systemctl",
            stats: [
                { value: "10+", label: "Пользователей" },
                { value: "99.9%", label: "Uptime" }
            ]
        }
    },
    {
        id: 3,
        title: "VK-бот с анкетами для знакомств",
        description: "Создание своей анкеты и просмотр анкет других пользователей с возможностью ставить симпатии, упрощая процесс знакомства",
        icon: "👋",
        images: [
            "assets/images/bot3.png",
            "assets/images/bot3/img_0.png",
            "assets/images/bot3/img_1.png",
            "assets/images/bot3/img_2.png",
            "assets/images/bot3/img_3.png",
            "assets/images/bot3/img_4.png",
            "assets/images/bot3/img_5.png",
            "assets/images/bot3/img_6.png",
        ],
        category: "vk.com",
        status: "Завершен, Поддержка",
        date: "30 марта 2025 г.",
        tags: ["Python", "ВКонтакте", "SQLite", "Artificial Intelligence"],
        details: {
            fullDescription: "",
            features: [
                "Создание своей анкеты и просмотр анкет других пользователей",
                "Возможность уточнять поиск анкет с помощью фильтров (например: по городу)",
                "Проверка существования населенного пункта в заданных регионах Российской Федерации",
                "Отправка симпатий другим пользователям. При взаимной симпатии есть возможность продолжить общение напрямую",
                "Искусственный интеллект: анализ загружаемых фотографий на наличие NSFW-контента и улучшение качества с помощью нейросети до студийного уровня"
            ],
            tech: "Backend: VKBottle, Tortoise-ORM, Transformers, GeoPy\nDeploy: работает на Linux-сервере, запускается через systemctl\n\nModels: eigen-ai-labs/eigen-banana-qwen-image-edit, Falconsai/nsfw_image_detection",
            stats: [
                { value: "100+", label: "Пользователей" },
                { value: "99.9%", label: "Uptime" }
            ]
        }
    },
    {
        id: 4,
        title: "SORA` (Discord-экосистема)",
        description: "Модульная Discord-экосистема из нескольких ботов и сайта. Реализованы саппорт-бот (верификация участников) и модератор-бот (наказания и администрирование). Проект находится в стадии развития и масштабирования",
        icon: "🌐",
        images: [
            "assets/images/bot4.png",
            "assets/images/bot4/img_0.png",
            "assets/images/bot4/img_1.png",
            "assets/images/bot4/img_2.png",
            "assets/images/bot4/img_3.png",
            "assets/images/bot4/img_4.png",
            "assets/images/bot4/img_5.png",
            "assets/images/bot4/img_6.png",
        ],
        category: "discord.com",
        status: "В процессе разработки",
        date: "W.I.P.",
        tags: ["Python", "Discord", "PostgreSQL", "Redis", "FastAPI"],
        details: {
            fullDescription: "",
            features: [
                "Минимальное количество неудобных слэш-команд: подавляющее большинство действий выполняется через современные возможности Discord — select-меню, модальные окна, кнопки и т.п. (Discord Components V2)",
                "Меню настроек для каждого бота с полной кастомизацией: добавление новых событий, включение/отключение логирования, настройка уровня доступа к командам, создание системы тикетов и многое другое",
                "Панель управления пользователем: верификация, недопуск, изменение пола и просмотр профиля",
                "Система использует проверенный временем стек PostgreSQL и Redis: Redis выполняет роль кэша для быстрого доступа к данным, а PostgreSQL обеспечивает долговременное и структурированное хранение информации",
                "Экосистема находится в активной разработке: новые функции и возможности регулярно добавляются, а в будущем её функционал будет расширен ещё значительней, чтобы покрыть больше сценариев и задач"
            ],
            tech: "Backend: Discord.PY, AsyncPG, Redis.AsyncIO, FastAPI\nDeploy: работает на Linux-сервере, запускается через Docker Compose",
            stats: [
                { value: "50+", label: "Пользователей" },
                { value: "95.1%", label: "Uptime" }
            ]
        }
    },
];